yangzecai/Visual-Tracking-Car/stm32/Visual-Tracking-Car/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2021 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f1xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define LED_Pin GPIO_PIN_13
#define LED_GPIO_Port GPIOC
#define ME1_A_Pin GPIO_PIN_0
#define ME1_A_GPIO_Port GPIOA
#define ME1_B_Pin GPIO_PIN_1
#define ME1_B_GPIO_Port GPIOA
#define ME2_A_Pin GPIO_PIN_6
#define ME2_A_GPIO_Port GPIOA
#define ME2_B_Pin GPIO_PIN_7
#define ME2_B_GPIO_Port GPIOA
#define MD_PWMA_Pin GPIO_PIN_8
#define MD_PWMA_GPIO_Port GPIOA
#define MD_PWMB_Pin GPIO_PIN_9
#define MD_PWMB_GPIO_Port GPIOA
#define MD_AIN1_Pin GPIO_PIN_10
#define MD_AIN1_GPIO_Port GPIOA
#define MD_AIN2_Pin GPIO_PIN_11
#define MD_AIN2_GPIO_Port GPIOA
#define MD_BIN1_Pin GPIO_PIN_12
#define MD_BIN1_GPIO_Port GPIOA
#define MD_BIN2_Pin GPIO_PIN_15
#define MD_BIN2_GPIO_Port GPIOA
/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
